app/views/employees/index.html.erb

<div class="container m-auto my-4">
  <% unless current_user.employees.any? %>
---
SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = ?  [["user_id", 2]]
SELECT 1 AS one FROM "employees" WHERE "employees"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]