app/views/events/index.html.erb

<div class="container m-auto my-4">
  <% unless current_user.events.any? %>
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]
SELECT 1 AS one FROM "events" WHERE "events"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]