app/views/shifts/index.html.erb

<div class="container m-auto my-4">
  <% unless current_user.shifts.any? %>
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."user_id" = ?  [["user_id", 1]]
SELECT 1 AS one FROM "shifts" WHERE "shifts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]