app/controllers/employees_controller.rb

INSERT INTO "employees" ("name", "position", "availability", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "John"], ["position", "Bartender"], ["availability", "Weekends Only"], ["user_id", 2], ["created_at", "2021-08-13 20:44:31.595381"], ["updated_at", "2021-08-13 20:44:31.595381"]]
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "name" = ?, "position" = ?, "availability" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["name", "Grace Comiskey"], ["position", "Bar Supervisor"], ["availability", "Anytime"], ["updated_at", "2021-08-17 17:07:48.921487"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 2]]
---
  def destroy
    @employee.destroy