app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = ?  [["user_id", 2]]
---
  def index
    @employees = current_user.employees.all

INSERT INTO "employees" ("name", "position", "availability", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Saoirse Godfrey"], ["position", "Bartender"], ["availability", "Wed-Sun"], ["user_id", 1], ["created_at", "2021-08-19 17:43:17.193703"], ["updated_at", "2021-08-19 17:43:17.193703"]]
---
  def create
    @employee = Employee.new(employee_params)
    @employee.user_id = current_user.id

    e = BasicEmployee.new(@employee.name, @employee.position, @employee.availability)

    if params[:position].to_s.include?('Manager') || params[:position].to_s.include?('Supervisor') || params[:position].to_s.include?('Head')
      e = ManagementEmployee.new(e)
    end

    @text = "A new employee was added: " + e.details

    write = FileWriter.instance
    write.logInfo(@text)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "name" = ?, "position" = ?, "availability" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["name", "Grace Comiskey"], ["position", "Bar Supervisor"], ["availability", "Anytime"], ["updated_at", "2021-08-17 17:07:48.921487"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 10]]
---
  def destroy
    @employee.destroy