app/controllers/events_controller.rb

    def index
      @events = current_user.events.all

      require 'net/http'
      require 'json'

      if !current_user.events.empty?
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]
SELECT 1 AS one FROM "events" WHERE "events"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]

  def create
    @event = Event.new(event_params)
    @event.user_id = current_user.id

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["city", "Galway"], ["user_id", 1], ["created_at", "2021-08-17 16:15:44.049109"], ["updated_at", "2021-08-17 16:15:44.049109"]]

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "city" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["city", "Galway"], ["updated_at", "2021-08-19 14:57:57.799345"], ["id", 1]]