app/controllers/shifts_controller.rb

SELECT "shifts".* FROM "shifts"
SELECT "shifts".* FROM "shifts" WHERE "shifts"."user_id" = ?  [["user_id", 1]]
---
  def index

    search = params[:term].present? ? params[:term] : '*'
    @shifts = if search
      Shift.search(search)
    else
      @shifts = current_user.shifts.all

INSERT INTO "shifts" ("name", "start_time", "end_time", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["start_time", "2021-08-19 22:00:00"], ["end_time", "2021-08-19 22:00:00"], ["user_id", 1], ["created_at", "2021-08-19 22:23:07.019909"], ["updated_at", "2021-08-19 22:23:07.019909"]]
---
  def create
    @shift = Shift.new(shift_params)
    @shift.user_id = current_user.id

    respond_to do |format|
      if @shift.save

UPDATE "shifts" SET "start_time" = ?, "end_time" = ?, "updated_at" = ? WHERE "shifts"."id" = ?  [["start_time", "2021-08-21 15:00:00"], ["end_time", "2021-08-21 23:00:00"], ["updated_at", "2021-08-20 15:41:59.432710"], ["id", 17]]
---
  def update
    respond_to do |format|
      if @shift.update(shift_params)

DELETE FROM "shifts" WHERE "shifts"."id" = ?  [["id", 12]]
---
  def destroy
    @shift.destroy

SELECT "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def set_shift
      @shift = Shift.find(params[:id])