app/controllers/shifts_controller.rb

  def create
    @shift = Shift.new(shift_params)
    @shift.user_id = current_user.id

    respond_to do |format|
      if @shift.save
---
INSERT INTO "shifts" ("name", "start_time", "end_time", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["start_time", "2021-08-17 17:00:00"], ["end_time", "2021-08-17 17:00:00"], ["user_id", 1], ["created_at", "2021-08-17 17:17:02.341510"], ["updated_at", "2021-08-17 17:17:02.341510"]]

  def update
    respond_to do |format|
      if @shift.update(shift_params)
---
UPDATE "shifts" SET "name" = ?, "start_time" = ?, "end_time" = ?, "updated_at" = ? WHERE "shifts"."id" = ?  [["name", "Aaron Doyle"], ["start_time", "2021-08-18 17:00:00"], ["end_time", "2021-08-18 23:00:00"], ["updated_at", "2021-08-18 12:32:05.787992"], ["id", 7]]

    def set_shift
      @shift = Shift.find(params[:id])
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]